Term4/metopt/lectures/12.tex
% Created 2021-04-14 Wed 11:34
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}
\newcommand{\llb}{\llbracket}
\newcommand{\rrb}{\rrbracket}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother

\newenvironment{rualgo}[1][]
  {\begin{algorithm}[#1]
     \selectlanguage{russian}%
     \floatname{algorithm}{Алгоритм}%
     \renewcommand{\algorithmicif}{{\color{red}\textbf{если}}}%
     \renewcommand{\algorithmicthen}{{\color{red}\textbf{тогда}}}%
     \renewcommand{\algorithmicelse}{{\color{red}\textbf{иначе}}}%
     \renewcommand{\algorithmicend}{{\color{red}\textbf{конец}}}%
     \renewcommand{\algorithmicfor}{{\color{red}\textbf{для}}}%
     \renewcommand{\algorithmicto}{{\color{red}\textbf{до}}}%
     \renewcommand{\algorithmicdo}{{\color{red}\textbf{делать}}}%
     \renewcommand{\algorithmicwhile}{{\color{red}\textbf{пока}}}%
     \renewcommand{\algorithmicrepeat}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicuntil}{{\color{red}\textbf{до тех пор пока}}}%
     \renewcommand{\algorithmicloop}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicnot}{{\color{blue}\textbf{не}}}%
     \renewcommand{\algorithmicand}{{\color{blue}\textbf{и}}}%
     \renewcommand{\algorithmicor}{{\color{blue}\textbf{или}}}%
     \renewcommand{\algorithmicrequire}{{\color{blue}\textbf{Предусловие}}}%
     \renewcommand{\algorithmicrensure}{{\color{blue}\textbf{Постусловие}}}%
     \renewcommand{\algorithmicrtrue}{{\color{blue}\textbf{истинна}}}%
     \renewcommand{\algorithmicrfalse}{{\color{blue}\textbf{ложь}}}%
     % Set other language requirements
  }
  {\end{algorithm}}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 12}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 12},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Прямые методы решения СЛАУ}
\label{sec:orge5a4f8d}
Виды разложения матрицы \(A\):
\begin{itemize}
\item \(LU\) --- \(L\) --- нижнеругольная матрциа, \(U\) --- верхнетреугольная матрица
\item \(LL^T\) --- метод квадратного корня
\item \(LDL^T\), \(L_{ii} = 1\)
\item \(D\) --- диагональная матрица
\end{itemize}


\[A = LU \addtag\label{eq_2_12} \]
\[ LUx = b \quad y = Ux\]
\[ Ly = b \addtag\label{eq_4_12} \]

\begin{enumerate}
\item \(A \implies L\) и \(U\)
\item решить \(\ref{eq_4_12}\) --- прямой ход: \(y\)
\item \(Ux = y\) --- обратный ход
\end{enumerate}
\[ L = \begin{bmatrix}
L_{11} & 0 & 0 & \dots \\
L_{21} & L_{22} & 0 & \dots \\
L_{31} & L_{32} & L_{33} & \dots \\
\vdots & \vdots & \vdots
\end{bmatrix}
U = \begin{bmatrix}
1 & U_{12} & U_{13} & \dots \\
0 & 1 & U_{23} & \dots \\
0 & 0 & 1 & \dots \\
\vdots & \vdots & \vdots
\end{bmatrix} \addtag\label{5_12}\]
Красным помечено то, что мы находим на текущем шаге
\begin{itemize}
\item \(A_{11} = \color{red}L_{11}\)
\item \(A_{21} = \color{red}L_{21}\)
\item \(A_{12} = L_{11} \cdot \color{red}U_{12}\)
\item \(A_{22} = L_{21} \cdot U_{12} + \color{red}L_{22}\)
\item \(A_{31} = \color{red}L_{31}\)
\item \(A_{32} = L_{31} \cdot U_{12} + \color{red}L_{32}\)
\item \(A_{13} = L_{11} \cdot \color{red}U_{13}\)
\item \(A_{23} = L_{21} \cdot U_{13} + L_{22}\cdot \color{red}U_{23}\)
\item \(A_{33} = L_{31} \cdot U_{13} + L_{32}\cdot U_{23} + \color{red}L_{33}\)
\begin{rualgo}[H]
\caption{Алгоритм разложения}
\begin{algorithmic}
\STATE \(A_{11} = L_{11}\)
\FOR{\(i \gets 2\) \TO \(n\)} \DO
  \FOR{\(j \gets 1\) \TO \(i - 1\)} \DO
    \STATE \(L_{ij} = A_{ij} - \sum_{k = 1}^{j - 1} L_{ik}\cdot U_{kj}\)
    \STATE \(U_{ji} = \frac{1}{L_{jj}} \left[A_{ji} - \sum_{k = 1}^{j - 1} L_{jk}\cdot U_{ki}\right]\)
  \ENDFOR
  \STATE \(L_{ii} = A_{ii} - \sum_{k = 1}^{i - 1} L_{ik} \cdot U_{ki}\)
\ENDFOR
\end{algorithmic}
\end{rualgo}
\end{itemize}
\subsection{Близкие к нулю главные элементы}
\label{sec:orgfc0c288}
ЭВМ: 5-разрядная арифметик с плавающей точки
\[ \begin{pmatrix}
10 & -7 & 0 \\
0 & -1.0\cdot 10^{-3} & 6 \\
0 & 2.5 & 5
\end{pmatrix}\begin{pmatrix}
x_1 \\
x_2 \\
x_3
\end{pmatrix} = \begin{pmatrix}
7 \\
6.001 \\
2.5
\end{pmatrix}\]
\[ 6.001 \cdot 2.5 \cdot 10^{-3} = 1.50025 \cdot 10^4 \approx 1.5003 \cdot 10^4 \]
\[ 1.5005 \cdot 10^4 \cdot x_3 = 1.5004 \cdot 10^4 \implies x_3 = \frac{1.5004 \cdot 10^4}{1.5005 \cdot 10^4} = 0.99993 \]
\[ -1.0\cdot 10^{-3}\cdot x_2 + 6\cdot 0.99993 = 6.0001 \implies x_2 = \frac{1.5 \cdot 10^{-3}}{-1.0 \cdot 10^{-3}} = -1.5\]
\[ 10\cdot x_1 + (-7) \cdot (-1.5) = 7 \implies x_1 = -0.35 \]
\[ x = (-0.35, -1.50, 0.99993) \]
Хотя правильный ответ: \(x^* = (0, -1, 1)\)
\subsection{Вектор ошибки и невязка}
\label{sec:orga405c7a}
\[ \begin{pmatrix}
0.780 & 0.563 \\
0.457 & 0.330
\end{pmatrix}\begin{pmatrix}
x_1 \\
x_2
\end{pmatrix} = \begin{pmatrix}
0.217 \\
0.127
\end{pmatrix}\]
ЭВМ: трехразрядная десятичная арифметика
\[ \frac{0.457}{0.780} = 0.586 \]
\[ \begin{pmatrix}
0.780 & 0.563 \\
0 & 0.0000820
\end{pmatrix}\begin{pmatrix}
x_1 \\
x_2
\end{pmatrix} = \begin{pmatrix}
0.217 \\
-0.000162
\end{pmatrix}\]
\[ x_2 = \frac{-0.00162}{0.0000820} = -1.98 \]
\[ x_1 = \frac{0.217 - 0.563\cdot x_2}{0.780} = 1.71 \]
\[ x = (1.71, -1.98)^T \]
\begin{definition}
\textbf{Невязка} \(\Gamma = b - Ax\). Если решение точное, то вектор невязки близок к \(0\)
\end{definition}
\[ \Gamma = (-0.00206, -0.00107)^T \]
Точным решением является вектор \(x^* = (1, -1)^T\) \\
Величина ошибки решения: \(\frac{\Vert x^* - x \Vert}{\Vert x^* \Vert}\)
\begin{definition}
\(\mathop{\rm cond}(A)\) --- число обусловленности \(A\). Отношение максимального и минимального собственного значения матрицы
\end{definition}
\noindentВеличина ошибки в решении приближенно равна величине решения \(\times\) \(\mathop{\rm cond}(A) \times \varepsilon_\text{маш.}\)
\begin{examp}
\(\mathop{\rm cond}(A) = 10^6,\ \varepsilon = 10^{-8}\). В решении --- 3 верных разряда
\end{examp}

\subsection{Векторные нормы}
\label{sec:org14d82af}
\begin{enumerate}
\item 2-норма (евклидова) \todo
\item 1-норма (манхэтенское расстояние)
\[ \Vert x \Vert_1 = \sum_{i = 1}^n |x_i| \]
\item \(\max\)-норма (\(\infty\)-норма)
\[ \Vert x \Vert_\infty = \todo \]
\end{enumerate}
\[ \Vert x \Vert > 0\text{, если } x\neq0\ \Vert 0 \Vert = 0 \]
\[ \Vert cx \Vert = |c|\cdot\Vert x \Vert \ \forall c \]
\[ \Vert x + y \Vert \le \Vert x \Vert + \Vert y \Vert \]
\[ Ax = b \]
\[ M = \max_x \frac{\Vert Ax \Vert}{\Vert x \Vert} \implies \Vert Ax \Vert \le M \cdot \Vert x \Vert \]
\[ m = \min_x \frac{\Vert Ax \Vert}{\Vert x \Vert} \implies \Vert Ax \Vert \ge m \cdot \Vert x \Vert \]
\(\frac{M}{m}\) --- число обусловленности матрицы \(A\)
\[ A(x + \Delta x) = b + \Delta b \]
Будем считать, что \(\Delta b\) --- ошибка в \(b\), \(\Delta x\) --- ошибка в \(x\). Поскольку \(A(\Delta x) = \Delta b\), то можно сказать, что:
\[ \Vert Ax \Vert = \Vert b \Vert \le M \cdot \Vert x \Vert \]
\[ \Vert A\Delta x\Vert = \Vert \Delta b \Vert \ge m \cdot \Vert \Delta x \Vert \]
При \(M \neq 0\)
\[ \frac{\Vert \Delta x \Vert}{\Vert x \Vert} \le \mathop{\rm cond}(A) \cdot \frac{\Vert \Delta b \Vert}{\Vert b \Vert} \]
\subsubsection{Свойства числа обусловленности}
\label{sec:orgca06a2b}
\[ M \ge m \]

\beginproperty
\begin{property}
\(\mathop{\rm cond}(A) \ge 1\) \\
\(P\) --- матрица перестановок, \(\mathop{\rm cond}(P) = 1\) \\
\(\mathop{\rm cond}(I) = 1\)
\end{property}
\begin{property}
\(\mathop{\rm cond}(c\cdot A) = \mathop{\rm cond}(A)\)
\end{property}
\begin{property}
\(D\) --- диагоняльная
\[ \mathop{\rm cond}(D) = \frac{\max|d_{ii}|}{\min |d_{ii}|} \]
\end{property}
\begin{examp}
\(D = \mathop{\rm diag}(0.1),\ n = 100\). \(\det D = 10^{-100}\) --- малое число
\[ \mathop{\rm cond}(A) = \frac{0.1}{0.1} = 1 \]
\end{examp}
\end{document}
